In [1]:
import pandas as pd
d=pd.Series([4,7,9,2,6])
print(d)

0    4
1    7
2    9
3    2
4    6
dtype: int64

In [2]:
x=d.to_list()
print(x)

[4, 7, 9, 2, 6]

In [3]:
print(type(d))
print(type(x))

<class 'pandas.core.series.Series'>
<class 'list'>

In [4]:
a=pd.Series([1,2,3,4,5])
b=pd.Series([6,7,8,9,10])
print("Sum",a+b)
print("Subtraction",a-b)
print("Multiplication",a*b)
print("Division",a/b)

Sum 0     7
1     9
2    11
3    13
4    15
dtype: int64
Subtraction 0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64
Multiplication 0     6
1    14
2    24
3    36
4    50
dtype: int64
Division 0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

In [5]:
print(a>b)
print(a<b)
print(a==b)
print(a!=b)

0    False
1    False
2    False
3    False
4    False
dtype: bool
0    True
1    True
2    True
3    True
4    True
dtype: bool
0    False
1    False
2    False
3    False
4    False
dtype: bool
0    True
1    True
2    True
3    True
4    True
dtype: bool

In [6]:
x={"a":1,"b":2,"c":3,"d":4}
y=pd.Series(x)
print(y)

a    1
b    2
c    3
d    4
dtype: int64

In [7]:
import numpy as np
x=np.array([1,34,14,45])
y=pd.Series(x)
print(y)

0     1
1    34
2    14
3    45
dtype: int32

In [8]:
x=pd.Series([100,200,"python",300,400])
print(x)
y=pd.to_numeric(x,errors='coerce')#invalid parsing will set as NaN
print(y)

0       100
1       200
2    python
3       300
4       400
dtype: object
0    100.0
1    200.0
2      NaN
3    300.0
4    400.0
dtype: float64

In [9]:
d={"a":[1,2,3,4,5],"b":[6,7,8,9,10],"c":[11,12,13,14,15]}
df=pd.DataFrame(data=d)
print(df)

   a   b   c
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [10]:
s=df.loc[:0]
print(s)

   a  b   c
0  1  6  11

In [11]:
s=df.loc[0:5].a
print(s)

0    1
1    2
2    3
3    4
4    5
Name: a, dtype: int64

In [12]:
x=pd.Series([["a","b","c"],["d","e"],["f"]])
y=x.apply(pd.Series).stack().reset_index(drop=True)
print(y)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [13]:
x=pd.Series([100,200,"python",300,400])
a=np.array(x.values.tolist())
print(a)

['100' '200' 'python' '300' '400']

In [14]:
import pandas as pd
data=pd.read_csv("pari.csv")
print(data)

   S.no   Name  Age Fav Cartoon
0     1    Anu   19     Doremon
1     2   Pari   21       Ninja
2     3   Manu    7        Dora
3     4  Jessi   10     Pokemon
4     5   Jack   11        Ferb
5     6   Jhon   16       Micky
6     7   Katy   23       Minni
7     8  Milon   30      Donald
8     9   Hydi   13       Goofy
9    10   Elle    4        Motu

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   S.no         10 non-null     int64
 1   Name         10 non-null     object
 2   Age          10 non-null     int64
 3   Fav Cartoon  10 non-null     object
dtypes: int64(2), object(2)
memory usage: 448.0+ bytes

In [16]:
data.head(7)

   S.no   Name  Age Fav Cartoon
0     1    Anu   19     Doremon
1     2   Pari   21       Ninja
2     3   Manu    7        Dora
3     4  Jessi   10     Pokemon
4     5   Jack   11        Ferb
5     6   Jhon   16       Micky
6     7   Katy   23       Minni

In [17]:
data.tail(3)

   S.no   Name  Age Fav Cartoon
7     8  Milon   30      Donald
8     9   Hydi   13       Goofy
9    10   Elle    4        Motu

In [18]:
data[["Age","Name"]]

   Age   Name
0   19    Anu
1   21   Pari
2    7   Manu
3   10  Jessi
4   11   Jack
5   16   Jhon
6   23   Katy
7   30  Milon
8   13   Hydi
9    4   Elle

In [19]:
data.describe()

           S.no        Age
count  10.00000  10.000000
mean    5.50000  15.400000
std     3.02765   7.961016
min     1.00000   4.000000
25%     3.25000  10.250000
50%     5.50000  14.500000
75%     7.75000  20.500000
max    10.00000  30.000000

In [20]:
data.Age.max()

30

In [21]:
type(data)

pandas.core.frame.DataFrame

In [22]:
data["Age"]>5

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9    False
Name: Age, dtype: bool

In [23]:
data[data["Age"]>15]

   S.no   Name  Age Fav Cartoon
0     1    Anu   19     Doremon
1     2   Pari   21       Ninja
5     6   Jhon   16       Micky
6     7   Katy   23       Minni
7     8  Milon   30      Donald

In [24]:
data.Age.describe()

count    10.000000
mean     15.400000
std       7.961016
min       4.000000
25%      10.250000
50%      14.500000
75%      20.500000
max      30.000000
Name: Age, dtype: float64

In [25]:
print(data.loc[4])

S.no              5
Name           Jack
Age              11
Fav Cartoon    Ferb
Name: 4, dtype: object

In [26]:
data.loc[1,"Name"]

'Pari'

In [27]:
data["Adress"]=["a","b","c","d","e","f","g","h","i","j"]
print(data)

   S.no   Name  Age Fav Cartoon Adress
0     1    Anu   19     Doremon      a
1     2   Pari   21       Ninja      b
2     3   Manu    7        Dora      c
3     4  Jessi   10     Pokemon      d
4     5   Jack   11        Ferb      e
5     6   Jhon   16       Micky      f
6     7   Katy   23       Minni      g
7     8  Milon   30      Donald      h
8     9   Hydi   13       Goofy      i
9    10   Elle    4        Motu      j

In [28]:
pd.options.display.max_rows

60

In [29]:
pd.options.display.min_rows

10

In [30]:
pd.options.display.max_rows=5
x=pd.read_csv("pari.csv")
print(x)

    S.no  Name  Age Fav Cartoon
0      1   Anu   19     Doremon
1      2  Pari   21       Ninja
..   ...   ...  ...         ...
8      9  Hydi   13       Goofy
9     10  Elle    4        Motu

[10 rows x 4 columns]